### Seleções e Frequências

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('dados/dados_residencial.csv',sep=';')

In [3]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
5,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
6,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
7,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
8,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
9,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0

#### Selecione somente os imóveis classificados por tipo 'Apartamento'

In [4]:
selecao = dados['Tipo'] == 'Apartamento'
selecao

0        False
1        False
2         True
3         True
4         True
         ...
22840     True
22841    False
22842     True
22843     True
22844     True
Name: Tipo, Length: 22845, dtype: bool

In [5]:
selecao = dados[selecao]
selecao.index = range(selecao.shape[0])
selecao

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
2,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
3,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
4,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19527,Apartamento,Vila Valqueire,2,0,0,52,1000.0,550.0,NaN
19528,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
19529,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
19530,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
19531,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

In [6]:
selecao['Tipo'].drop_duplicates()

0    Apartamento
Name: Tipo, dtype: object

In [7]:
n1=selecao['Tipo'].shape[0]

In [8]:
dados

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
22840,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
22841,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
22842,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
22843,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
22844,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

#### Selecione imóveis casa, casa de condomínio e casa de vila

In [9]:
dados = pd.read_csv('dados/dados_residencial.csv',sep=';')

In [10]:
selecao =( dados['Area'] == 'Casa') | (dados['Tipo'] == 'Casa de Condomínio') | (dados['Tipo'] == 'Casa de Vila')

In [11]:
n2 = dados[selecao].shape[0]

n2

1245

In [12]:
n2 = dados[selecao].shape[0]
n2

1245

#### Selecione imóveis com área entre 60 e 100 metros quadrados, incluindo os limites

In [13]:
selecao =( dados['Area'] >= 60) & ( dados['Area'] <= 100)

In [14]:
n3 =  dados[selecao].shape[0]

In [15]:
n3

8736

#### Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00

In [16]:
selecao =( dados['Quartos'] >= 4 ) & ( dados['Valor'] < 2000)

In [17]:
n4 =  dados[selecao].shape[0]

In [18]:
n4

41

In [19]:
print("Numero de imóveis classificados com tipo 'Apartamento'->{}".format(n1))

Numero de imóveis classificados com tipo 'Apartamento'->19532

In [20]:
'l1 l2'.split()

['l1', 'l2']

In [21]:
data = [(1,2,3,4),(5,6,7,8),(9,10,11,12),(13,14,15,16)]

In [35]:
df = pd.DataFrame(data, 'l1 l2 l3 l6'.split(),'c1 c2 c3 c6'.split())

In [36]:
df

    c1  c2  c3  c6
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l6  13  14  15  16

In [37]:
df['c1']

l1     1
l2     5
l3     9
l6    13
Name: c1, dtype: int64

In [38]:
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l6  15  13

In [39]:
df[:]

    c1  c2  c3  c6
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l6  13  14  15  16

In [40]:
df[1:]

    c1  c2  c3  c6
l2   5   6   7   8
l3   9  10  11  12
l6  13  14  15  16

In [41]:
df[1:3]

    c1  c2  c3  c6
l2   5   6   7   8
l3   9  10  11  12

In [42]:
df[1:][['c3','c1']]

    c3  c1
l2   7   5
l3  11   9
l6  15  13

In [43]:
df.loc['l3']

c1     9
c2    10
c3    11
c6    12
Name: l3, dtype: int64

In [49]:
df.loc[['l3','l2']]

    c1  c2  c3  c6
l3   9  10  11  12
l2   5   6   7   8

In [45]:
df.loc['l1','c2']

2

In [46]:
df.iloc[0,1]

2

In [48]:
df.loc[['l3','l1'],['c1','c2']]

    c1  c2
l3   9  10
l1   1   2

In [50]:
df.iloc[[2,0],[0,1]]

    c1  c2
l3   9  10
l1   1   2